//Вид 1
// void Method1()
// {
//     Console.WriteLine("Разработчик программы Александр Лозинский");
// }
// Method1(); Так мы вызываем метод 
//_________________________________________________________________________________________________________________
// Вид 2
// void Method2(string msg)
// {
//    Console.WriteLine(msg);
// }
// Method2(msg: "Текст сообщения");
//__________________________________________________________________________________________________________________
// ВИД 2.1
// void Method21(string msg, int count)
// {
//    int i = 0;
//    while(i < count)
//    {
//       Console.WriteLine(msg);
//       i++;
//    } 
// }
// Method21("Текст", 5);
// Method21(count: 5, msg: "Текст");
//______________________________________________________________________________________________________________________
// Вид 3
// int Method3() // Если метод что-то возвращает, то нужно указать тип данных, значение которых мы ожидаем, т.е int
// {
//     return DateTime.Now.Year;
// }
// int year = Method3();// слева вызываем имя или идентификатор метода "Method3();", далее используем идентификатор 
// // переменной "year" и через оператор присваивания = положим нужное значение
// Console.WriteLine(year);// в дальнейшем мы можем использовать переменную и то значение, которое вернул нам метод
//_____________________________________________________________________________________________________________________
// Вид 4 САМАЯ ВАЖНАЯ ГРУППА МЕТОДОВ, КОТОРЫЕ ЧТО-ТО ПРИНИМАЕЮТИ ЧТО-ТО ВОЗВРАЩАЮТ
// string Method4(int count, string text)
// {
//    int i = 0;
//    string result = String.Empty;// изначально сюда закладывается пустая строка и это переводится как "result" (резалт) 
//    // "String.Empty" уходит пустой строкой
//    while(i< count)
//    {
//         result = result + text;
//         i++;
//    }
//    return result;// далее используем классический оператор return,
//    // в котором указываем тот результат(переменную result), значение которого ожидаем получить из метода
// }
// string result = Method4(10, "G");// Для того, чтобы вызвать Метод4, нам следует создать нужную нам переменную
// // "string result", указать, например, заначение 10 и текст, который будем склеивать десять раз
// Console.WriteLine(result);